Revit 2026 API

# DirectContext3DHandleSettingsSetColor Method

---

Sets the color of the handle and the associated DirectContext3D graphics.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetColor(
	Color color
)
```
```vb
Public Sub SetColor (
	color As Color
)
```
```cpp
public:
void SetColor(
	Color^ color
)
```
```fsharp
member SetColor :
        color : Color -> unit
```

#### Parameters

color Color
     The color to apply.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectContext3DHandleSettings Class

Autodesk.Revit.DB.DirectContext3D Namespace